'use client'

import { usePathname } from 'next/navigation'
import Link from 'next/link' 
import Error from './error'

import React from 'react'

export default function Page() {
  const pathname = usePathname()
  console.log(pathname)
  return (
    <div>
      <Link href={'/about/about1'}>德玛西亚</Link>
      <p id='1'>
        本作女主角，其真实身份为“天壤劫火”亚拉斯特尔的火雾战士，别号炎发灼眼的杀手，但年龄上只有十五六岁[1]，也有着非常少女的一面。

        性格倔强。面对强大的敌人不怯露，不服输，但面对亲友尤其是u2君，也不擅长表露心意，口头禅为无路赛三连发（うるさい うるさい うるさい）[2]。

        外貌出众。甚至连其敌人法利亚格尼都曾赞扬过她的美貌[3]。而她的及腰的乌黑的长发，和褐色的大眼睛，会在战斗的时候变成赤红色的，所谓炎发灼眼。

        身材矮小。由于在很小的年纪（十二三岁[1]）就与亚拉斯特尔签订了火雾战士的契约，身体停止生长因此维持了娇小的体型，但是作为火雾战士，体力和力量皆远超常人。

        能力强大。战斗方面，仅以体术就能对付很多红世之徒，在得到佩刀贽殿遮那后，也常使用贽殿遮那消灭红世之徒。前期不甚精通自在法，但后期领悟了真红、飞焰、审判、断罪等自在法（作为炎发灼眼的讨伐者时的能力）。其他方面也堪称天才，如在悠二的学校期间多次考试成绩出众，体育能力也十分强（作为夏娜时的能力）。

        不谙世事。从小由于被当作“完美火雾战士”培养，并没有被教会太多生活常识，所以常常显得很冒失，甚至缺乏某些生理常识一美，教我怎么制造孩子.jpg。


        开心地吃着蜜瓜包的夏娜
        爱吃甜食。夏娜酷爱吃甜食，尤其喜爱吃蜜瓜包，小说和动画版中均有大量桥段涉及夏娜吃甜食，特别是蜜瓜包的部分。

        随着故事的推进，夏娜的性格和能力也在变化着，从傲娇到不那么傲娇（雾）。

        灼眼の人物关系
        和坂井悠二：尽管一开始，夏娜的确只是把悠二当作一个普通的密斯提斯，但随着与悠二的相处的深入，随着对悠二的了解日渐变多，也开始对悠二产生好感，也就是恋爱的情绪。同时他们不仅在日常生活中朝夕相处[4]中互相帮助；在战斗中，他们也并肩作战，对此，夏娜有一句经典发言：“我不是要把悠二带回来，而是要和他一起战斗”。后期尽管因为立场和做法的对立，夏娜和悠二也曾一度刀兵相向，但最终和解，修成正果。

        和亚拉斯特尔：夏娜是亚拉斯特尔的签约对象，即火雾战士，是由亚里斯特尔等从小专门培养的火雾战士。在战斗中夏娜非常信任亚拉斯特尔，亚拉斯特尔也经常对夏娜做出一些指导。在平时，亚拉斯特尔也如同长辈那般陪伴着夏娜。夏娜是能完全承载亚拉斯特尔力量的伟大之人。

        和吉田一美：夏娜和吉田一美都喜欢坂井悠二，吉田一美对坂井悠二的很多示好行为（如带便当）常常让夏娜不悦吃醋，但在彼此接触更深，特别是吉田一美也了解到世界的真相，开始与夏娜他们一起处理红世之徒的问题后，夏娜和吉田一美也成为了好朋友。故事的最后夏娜和悠二修成正果时，吉田一美也流露出祝福的情绪三诛川澄第一诛（悲）。

        和威尔艾米娜：夏娜原是威尔艾米娜捡到的孤儿，后被发现有成为完美火雾战士潜质后，被威尔艾米娜等开始悉心培养。在天道宫时，威尔艾米娜照顾夏娜的日常起居，相当于夏娜的保姆（当然从情感上说“养母”或许更合适）。夏娜和威尔艾米娜感情很深，后来二人因悠二而起的争执曾让威尔艾米娜非常难过[5]。

        和坂井千草：坂井悠二的母亲坂井千草非常喜欢夏娜，常称呼夏娜为“夏娜酱”，不仅欢迎夏娜锻炼坂井悠二，日常生活上也时常照顾夏娜，在夏娜遇到恋爱上的问题（关于kiss的问题）时，也认真回答了夏娜的问题，在面对亚拉斯特尔以及威尔艾米娜 关于夏娜变化的质疑时，千草也站在夏娜这一边，积极为她说话，先后说服了他们。一定程度上，对于夏娜来说，相对于威尔艾米娜，坂井千草是另一种意义上的母亲不能简单理解为婆婆。

        和梅利希姆：为了实现先代「炎发灼眼的讨伐者」玛蒂达·桑特美尔找到继承者的遗言，梅利希姆在天道宫上以白骨的形态存在着，和威尔艾米娜一起培养着夏娜，比起威尔艾米娜，梅利希姆主要负责锻炼夏娜，夏娜称呼梅利希姆为“小白”。在天道宫的屏障被虹天剑破坏以后，梅利希姆向夏娜显出了人形，并使用最后的存在之力，向夏娜展示了自在法，给夏娜上了最后一课。对于夏娜来说，梅利希姆是师傅，也是一定程度上的养父。

        和玛蒂达·桑特美尔：夏娜当然不认识玛蒂达，但是夏娜是在玛蒂达的遗志下被培养长大的，她们是继承者和被继承者的关系。

        阅读更多：夏娜（https://zh.moegirl.org.cn/%E5%A4%8F%E5%A8%9C ）
        本文引自萌娘百科(https://zh.moegirl.org.cn )，文字内容默认使用《知识共享 署名-非商业性使用-相同方式共享 3.0 中国大陆》协议。
      </p>
      <p id='2'>
        本作女主角，其真实身份为“天壤劫火”亚拉斯特尔的火雾战士，别号炎发灼眼的杀手，但年龄上只有十五六岁[1]，也有着非常少女的一面。

        性格倔强。面对强大的敌人不怯露，不服输，但面对亲友尤其是u2君，也不擅长表露心意，口头禅为无路赛三连发（うるさい うるさい うるさい）[2]。

        外貌出众。甚至连其敌人法利亚格尼都曾赞扬过她的美貌[3]。而她的及腰的乌黑的长发，和褐色的大眼睛，会在战斗的时候变成赤红色的，所谓炎发灼眼。

        身材矮小。由于在很小的年纪（十二三岁[1]）就与亚拉斯特尔签订了火雾战士的契约，身体停止生长因此维持了娇小的体型，但是作为火雾战士，体力和力量皆远超常人。

        能力强大。战斗方面，仅以体术就能对付很多红世之徒，在得到佩刀贽殿遮那后，也常使用贽殿遮那消灭红世之徒。前期不甚精通自在法，但后期领悟了真红、飞焰、审判、断罪等自在法（作为炎发灼眼的讨伐者时的能力）。其他方面也堪称天才，如在悠二的学校期间多次考试成绩出众，体育能力也十分强（作为夏娜时的能力）。

        不谙世事。从小由于被当作“完美火雾战士”培养，并没有被教会太多生活常识，所以常常显得很冒失，甚至缺乏某些生理常识一美，教我怎么制造孩子.jpg。


        开心地吃着蜜瓜包的夏娜
        爱吃甜食。夏娜酷爱吃甜食，尤其喜爱吃蜜瓜包，小说和动画版中均有大量桥段涉及夏娜吃甜食，特别是蜜瓜包的部分。

        随着故事的推进，夏娜的性格和能力也在变化着，从傲娇到不那么傲娇（雾）。

        灼眼の人物关系
        和坂井悠二：尽管一开始，夏娜的确只是把悠二当作一个普通的密斯提斯，但随着与悠二的相处的深入，随着对悠二的了解日渐变多，也开始对悠二产生好感，也就是恋爱的情绪。同时他们不仅在日常生活中朝夕相处[4]中互相帮助；在战斗中，他们也并肩作战，对此，夏娜有一句经典发言：“我不是要把悠二带回来，而是要和他一起战斗”。后期尽管因为立场和做法的对立，夏娜和悠二也曾一度刀兵相向，但最终和解，修成正果。

        和亚拉斯特尔：夏娜是亚拉斯特尔的签约对象，即火雾战士，是由亚里斯特尔等从小专门培养的火雾战士。在战斗中夏娜非常信任亚拉斯特尔，亚拉斯特尔也经常对夏娜做出一些指导。在平时，亚拉斯特尔也如同长辈那般陪伴着夏娜。夏娜是能完全承载亚拉斯特尔力量的伟大之人。

        和吉田一美：夏娜和吉田一美都喜欢坂井悠二，吉田一美对坂井悠二的很多示好行为（如带便当）常常让夏娜不悦吃醋，但在彼此接触更深，特别是吉田一美也了解到世界的真相，开始与夏娜他们一起处理红世之徒的问题后，夏娜和吉田一美也成为了好朋友。故事的最后夏娜和悠二修成正果时，吉田一美也流露出祝福的情绪三诛川澄第一诛（悲）。

        和威尔艾米娜：夏娜原是威尔艾米娜捡到的孤儿，后被发现有成为完美火雾战士潜质后，被威尔艾米娜等开始悉心培养。在天道宫时，威尔艾米娜照顾夏娜的日常起居，相当于夏娜的保姆（当然从情感上说“养母”或许更合适）。夏娜和威尔艾米娜感情很深，后来二人因悠二而起的争执曾让威尔艾米娜非常难过[5]。

        和坂井千草：坂井悠二的母亲坂井千草非常喜欢夏娜，常称呼夏娜为“夏娜酱”，不仅欢迎夏娜锻炼坂井悠二，日常生活上也时常照顾夏娜，在夏娜遇到恋爱上的问题（关于kiss的问题）时，也认真回答了夏娜的问题，在面对亚拉斯特尔以及威尔艾米娜 关于夏娜变化的质疑时，千草也站在夏娜这一边，积极为她说话，先后说服了他们。一定程度上，对于夏娜来说，相对于威尔艾米娜，坂井千草是另一种意义上的母亲不能简单理解为婆婆。

        和梅利希姆：为了实现先代「炎发灼眼的讨伐者」玛蒂达·桑特美尔找到继承者的遗言，梅利希姆在天道宫上以白骨的形态存在着，和威尔艾米娜一起培养着夏娜，比起威尔艾米娜，梅利希姆主要负责锻炼夏娜，夏娜称呼梅利希姆为“小白”。在天道宫的屏障被虹天剑破坏以后，梅利希姆向夏娜显出了人形，并使用最后的存在之力，向夏娜展示了自在法，给夏娜上了最后一课。对于夏娜来说，梅利希姆是师傅，也是一定程度上的养父。

        和玛蒂达·桑特美尔：夏娜当然不认识玛蒂达，但是夏娜是在玛蒂达的遗志下被培养长大的，她们是继承者和被继承者的关系。

        阅读更多：夏娜（https://zh.moegirl.org.cn/%E5%A4%8F%E5%A8%9C ）
        本文引自萌娘百科(https://zh.moegirl.org.cn )，文字内容默认使用《知识共享 署名-非商业性使用-相同方式共享 3.0 中国大陆》协议。
      </p>
      <p id='3'>
        本作女主角，其真实身份为“天壤劫火”亚拉斯特尔的火雾战士，别号炎发灼眼的杀手，但年龄上只有十五六岁[1]，也有着非常少女的一面。

        性格倔强。面对强大的敌人不怯露，不服输，但面对亲友尤其是u2君，也不擅长表露心意，口头禅为无路赛三连发（うるさい うるさい うるさい）[2]。

        外貌出众。甚至连其敌人法利亚格尼都曾赞扬过她的美貌[3]。而她的及腰的乌黑的长发，和褐色的大眼睛，会在战斗的时候变成赤红色的，所谓炎发灼眼。

        身材矮小。由于在很小的年纪（十二三岁[1]）就与亚拉斯特尔签订了火雾战士的契约，身体停止生长因此维持了娇小的体型，但是作为火雾战士，体力和力量皆远超常人。

        能力强大。战斗方面，仅以体术就能对付很多红世之徒，在得到佩刀贽殿遮那后，也常使用贽殿遮那消灭红世之徒。前期不甚精通自在法，但后期领悟了真红、飞焰、审判、断罪等自在法（作为炎发灼眼的讨伐者时的能力）。其他方面也堪称天才，如在悠二的学校期间多次考试成绩出众，体育能力也十分强（作为夏娜时的能力）。

        不谙世事。从小由于被当作“完美火雾战士”培养，并没有被教会太多生活常识，所以常常显得很冒失，甚至缺乏某些生理常识一美，教我怎么制造孩子.jpg。


        开心地吃着蜜瓜包的夏娜
        爱吃甜食。夏娜酷爱吃甜食，尤其喜爱吃蜜瓜包，小说和动画版中均有大量桥段涉及夏娜吃甜食，特别是蜜瓜包的部分。

        随着故事的推进，夏娜的性格和能力也在变化着，从傲娇到不那么傲娇（雾）。

        灼眼の人物关系
        和坂井悠二：尽管一开始，夏娜的确只是把悠二当作一个普通的密斯提斯，但随着与悠二的相处的深入，随着对悠二的了解日渐变多，也开始对悠二产生好感，也就是恋爱的情绪。同时他们不仅在日常生活中朝夕相处[4]中互相帮助；在战斗中，他们也并肩作战，对此，夏娜有一句经典发言：“我不是要把悠二带回来，而是要和他一起战斗”。后期尽管因为立场和做法的对立，夏娜和悠二也曾一度刀兵相向，但最终和解，修成正果。

        和亚拉斯特尔：夏娜是亚拉斯特尔的签约对象，即火雾战士，是由亚里斯特尔等从小专门培养的火雾战士。在战斗中夏娜非常信任亚拉斯特尔，亚拉斯特尔也经常对夏娜做出一些指导。在平时，亚拉斯特尔也如同长辈那般陪伴着夏娜。夏娜是能完全承载亚拉斯特尔力量的伟大之人。

        和吉田一美：夏娜和吉田一美都喜欢坂井悠二，吉田一美对坂井悠二的很多示好行为（如带便当）常常让夏娜不悦吃醋，但在彼此接触更深，特别是吉田一美也了解到世界的真相，开始与夏娜他们一起处理红世之徒的问题后，夏娜和吉田一美也成为了好朋友。故事的最后夏娜和悠二修成正果时，吉田一美也流露出祝福的情绪三诛川澄第一诛（悲）。

        和威尔艾米娜：夏娜原是威尔艾米娜捡到的孤儿，后被发现有成为完美火雾战士潜质后，被威尔艾米娜等开始悉心培养。在天道宫时，威尔艾米娜照顾夏娜的日常起居，相当于夏娜的保姆（当然从情感上说“养母”或许更合适）。夏娜和威尔艾米娜感情很深，后来二人因悠二而起的争执曾让威尔艾米娜非常难过[5]。

        和坂井千草：坂井悠二的母亲坂井千草非常喜欢夏娜，常称呼夏娜为“夏娜酱”，不仅欢迎夏娜锻炼坂井悠二，日常生活上也时常照顾夏娜，在夏娜遇到恋爱上的问题（关于kiss的问题）时，也认真回答了夏娜的问题，在面对亚拉斯特尔以及威尔艾米娜 关于夏娜变化的质疑时，千草也站在夏娜这一边，积极为她说话，先后说服了他们。一定程度上，对于夏娜来说，相对于威尔艾米娜，坂井千草是另一种意义上的母亲不能简单理解为婆婆。

        和梅利希姆：为了实现先代「炎发灼眼的讨伐者」玛蒂达·桑特美尔找到继承者的遗言，梅利希姆在天道宫上以白骨的形态存在着，和威尔艾米娜一起培养着夏娜，比起威尔艾米娜，梅利希姆主要负责锻炼夏娜，夏娜称呼梅利希姆为“小白”。在天道宫的屏障被虹天剑破坏以后，梅利希姆向夏娜显出了人形，并使用最后的存在之力，向夏娜展示了自在法，给夏娜上了最后一课。对于夏娜来说，梅利希姆是师傅，也是一定程度上的养父。

        和玛蒂达·桑特美尔：夏娜当然不认识玛蒂达，但是夏娜是在玛蒂达的遗志下被培养长大的，她们是继承者和被继承者的关系。

        阅读更多：夏娜（https://zh.moegirl.org.cn/%E5%A4%8F%E5%A8%9C ）
        本文引自萌娘百科(https://zh.moegirl.org.cn )，文字内容默认使用《知识共享 署名-非商业性使用-相同方式共享 3.0 中国大陆》协议。
      </p>
      <p id='4'>
        本作女主角，其真实身份为“天壤劫火”亚拉斯特尔的火雾战士，别号炎发灼眼的杀手，但年龄上只有十五六岁[1]，也有着非常少女的一面。

        性格倔强。面对强大的敌人不怯露，不服输，但面对亲友尤其是u2君，也不擅长表露心意，口头禅为无路赛三连发（うるさい うるさい うるさい）[2]。

        外貌出众。甚至连其敌人法利亚格尼都曾赞扬过她的美貌[3]。而她的及腰的乌黑的长发，和褐色的大眼睛，会在战斗的时候变成赤红色的，所谓炎发灼眼。

        身材矮小。由于在很小的年纪（十二三岁[1]）就与亚拉斯特尔签订了火雾战士的契约，身体停止生长因此维持了娇小的体型，但是作为火雾战士，体力和力量皆远超常人。

        能力强大。战斗方面，仅以体术就能对付很多红世之徒，在得到佩刀贽殿遮那后，也常使用贽殿遮那消灭红世之徒。前期不甚精通自在法，但后期领悟了真红、飞焰、审判、断罪等自在法（作为炎发灼眼的讨伐者时的能力）。其他方面也堪称天才，如在悠二的学校期间多次考试成绩出众，体育能力也十分强（作为夏娜时的能力）。

        不谙世事。从小由于被当作“完美火雾战士”培养，并没有被教会太多生活常识，所以常常显得很冒失，甚至缺乏某些生理常识一美，教我怎么制造孩子.jpg。


        开心地吃着蜜瓜包的夏娜
        爱吃甜食。夏娜酷爱吃甜食，尤其喜爱吃蜜瓜包，小说和动画版中均有大量桥段涉及夏娜吃甜食，特别是蜜瓜包的部分。

        随着故事的推进，夏娜的性格和能力也在变化着，从傲娇到不那么傲娇（雾）。

        灼眼の人物关系
        和坂井悠二：尽管一开始，夏娜的确只是把悠二当作一个普通的密斯提斯，但随着与悠二的相处的深入，随着对悠二的了解日渐变多，也开始对悠二产生好感，也就是恋爱的情绪。同时他们不仅在日常生活中朝夕相处[4]中互相帮助；在战斗中，他们也并肩作战，对此，夏娜有一句经典发言：“我不是要把悠二带回来，而是要和他一起战斗”。后期尽管因为立场和做法的对立，夏娜和悠二也曾一度刀兵相向，但最终和解，修成正果。

        和亚拉斯特尔：夏娜是亚拉斯特尔的签约对象，即火雾战士，是由亚里斯特尔等从小专门培养的火雾战士。在战斗中夏娜非常信任亚拉斯特尔，亚拉斯特尔也经常对夏娜做出一些指导。在平时，亚拉斯特尔也如同长辈那般陪伴着夏娜。夏娜是能完全承载亚拉斯特尔力量的伟大之人。

        和吉田一美：夏娜和吉田一美都喜欢坂井悠二，吉田一美对坂井悠二的很多示好行为（如带便当）常常让夏娜不悦吃醋，但在彼此接触更深，特别是吉田一美也了解到世界的真相，开始与夏娜他们一起处理红世之徒的问题后，夏娜和吉田一美也成为了好朋友。故事的最后夏娜和悠二修成正果时，吉田一美也流露出祝福的情绪三诛川澄第一诛（悲）。

        和威尔艾米娜：夏娜原是威尔艾米娜捡到的孤儿，后被发现有成为完美火雾战士潜质后，被威尔艾米娜等开始悉心培养。在天道宫时，威尔艾米娜照顾夏娜的日常起居，相当于夏娜的保姆（当然从情感上说“养母”或许更合适）。夏娜和威尔艾米娜感情很深，后来二人因悠二而起的争执曾让威尔艾米娜非常难过[5]。

        和坂井千草：坂井悠二的母亲坂井千草非常喜欢夏娜，常称呼夏娜为“夏娜酱”，不仅欢迎夏娜锻炼坂井悠二，日常生活上也时常照顾夏娜，在夏娜遇到恋爱上的问题（关于kiss的问题）时，也认真回答了夏娜的问题，在面对亚拉斯特尔以及威尔艾米娜 关于夏娜变化的质疑时，千草也站在夏娜这一边，积极为她说话，先后说服了他们。一定程度上，对于夏娜来说，相对于威尔艾米娜，坂井千草是另一种意义上的母亲不能简单理解为婆婆。

        和梅利希姆：为了实现先代「炎发灼眼的讨伐者」玛蒂达·桑特美尔找到继承者的遗言，梅利希姆在天道宫上以白骨的形态存在着，和威尔艾米娜一起培养着夏娜，比起威尔艾米娜，梅利希姆主要负责锻炼夏娜，夏娜称呼梅利希姆为“小白”。在天道宫的屏障被虹天剑破坏以后，梅利希姆向夏娜显出了人形，并使用最后的存在之力，向夏娜展示了自在法，给夏娜上了最后一课。对于夏娜来说，梅利希姆是师傅，也是一定程度上的养父。

        和玛蒂达·桑特美尔：夏娜当然不认识玛蒂达，但是夏娜是在玛蒂达的遗志下被培养长大的，她们是继承者和被继承者的关系。

        阅读更多：夏娜（https://zh.moegirl.org.cn/%E5%A4%8F%E5%A8%9C ）
        本文引自萌娘百科(https://zh.moegirl.org.cn )，文字内容默认使用《知识共享 署名-非商业性使用-相同方式共享 3.0 中国大陆》协议。
      </p>
      <p id='5'>
        本作女主角，其真实身份为“天壤劫火”亚拉斯特尔的火雾战士，别号炎发灼眼的杀手，但年龄上只有十五六岁[1]，也有着非常少女的一面。

        性格倔强。面对强大的敌人不怯露，不服输，但面对亲友尤其是u2君，也不擅长表露心意，口头禅为无路赛三连发（うるさい うるさい うるさい）[2]。

        外貌出众。甚至连其敌人法利亚格尼都曾赞扬过她的美貌[3]。而她的及腰的乌黑的长发，和褐色的大眼睛，会在战斗的时候变成赤红色的，所谓炎发灼眼。

        身材矮小。由于在很小的年纪（十二三岁[1]）就与亚拉斯特尔签订了火雾战士的契约，身体停止生长因此维持了娇小的体型，但是作为火雾战士，体力和力量皆远超常人。

        能力强大。战斗方面，仅以体术就能对付很多红世之徒，在得到佩刀贽殿遮那后，也常使用贽殿遮那消灭红世之徒。前期不甚精通自在法，但后期领悟了真红、飞焰、审判、断罪等自在法（作为炎发灼眼的讨伐者时的能力）。其他方面也堪称天才，如在悠二的学校期间多次考试成绩出众，体育能力也十分强（作为夏娜时的能力）。

        不谙世事。从小由于被当作“完美火雾战士”培养，并没有被教会太多生活常识，所以常常显得很冒失，甚至缺乏某些生理常识一美，教我怎么制造孩子.jpg。


        开心地吃着蜜瓜包的夏娜
        爱吃甜食。夏娜酷爱吃甜食，尤其喜爱吃蜜瓜包，小说和动画版中均有大量桥段涉及夏娜吃甜食，特别是蜜瓜包的部分。

        随着故事的推进，夏娜的性格和能力也在变化着，从傲娇到不那么傲娇（雾）。

        灼眼の人物关系
        和坂井悠二：尽管一开始，夏娜的确只是把悠二当作一个普通的密斯提斯，但随着与悠二的相处的深入，随着对悠二的了解日渐变多，也开始对悠二产生好感，也就是恋爱的情绪。同时他们不仅在日常生活中朝夕相处[4]中互相帮助；在战斗中，他们也并肩作战，对此，夏娜有一句经典发言：“我不是要把悠二带回来，而是要和他一起战斗”。后期尽管因为立场和做法的对立，夏娜和悠二也曾一度刀兵相向，但最终和解，修成正果。

        和亚拉斯特尔：夏娜是亚拉斯特尔的签约对象，即火雾战士，是由亚里斯特尔等从小专门培养的火雾战士。在战斗中夏娜非常信任亚拉斯特尔，亚拉斯特尔也经常对夏娜做出一些指导。在平时，亚拉斯特尔也如同长辈那般陪伴着夏娜。夏娜是能完全承载亚拉斯特尔力量的伟大之人。

        和吉田一美：夏娜和吉田一美都喜欢坂井悠二，吉田一美对坂井悠二的很多示好行为（如带便当）常常让夏娜不悦吃醋，但在彼此接触更深，特别是吉田一美也了解到世界的真相，开始与夏娜他们一起处理红世之徒的问题后，夏娜和吉田一美也成为了好朋友。故事的最后夏娜和悠二修成正果时，吉田一美也流露出祝福的情绪三诛川澄第一诛（悲）。

        和威尔艾米娜：夏娜原是威尔艾米娜捡到的孤儿，后被发现有成为完美火雾战士潜质后，被威尔艾米娜等开始悉心培养。在天道宫时，威尔艾米娜照顾夏娜的日常起居，相当于夏娜的保姆（当然从情感上说“养母”或许更合适）。夏娜和威尔艾米娜感情很深，后来二人因悠二而起的争执曾让威尔艾米娜非常难过[5]。

        和坂井千草：坂井悠二的母亲坂井千草非常喜欢夏娜，常称呼夏娜为“夏娜酱”，不仅欢迎夏娜锻炼坂井悠二，日常生活上也时常照顾夏娜，在夏娜遇到恋爱上的问题（关于kiss的问题）时，也认真回答了夏娜的问题，在面对亚拉斯特尔以及威尔艾米娜 关于夏娜变化的质疑时，千草也站在夏娜这一边，积极为她说话，先后说服了他们。一定程度上，对于夏娜来说，相对于威尔艾米娜，坂井千草是另一种意义上的母亲不能简单理解为婆婆。

        和梅利希姆：为了实现先代「炎发灼眼的讨伐者」玛蒂达·桑特美尔找到继承者的遗言，梅利希姆在天道宫上以白骨的形态存在着，和威尔艾米娜一起培养着夏娜，比起威尔艾米娜，梅利希姆主要负责锻炼夏娜，夏娜称呼梅利希姆为“小白”。在天道宫的屏障被虹天剑破坏以后，梅利希姆向夏娜显出了人形，并使用最后的存在之力，向夏娜展示了自在法，给夏娜上了最后一课。对于夏娜来说，梅利希姆是师傅，也是一定程度上的养父。

        和玛蒂达·桑特美尔：夏娜当然不认识玛蒂达，但是夏娜是在玛蒂达的遗志下被培养长大的，她们是继承者和被继承者的关系。

        阅读更多：夏娜（https://zh.moegirl.org.cn/%E5%A4%8F%E5%A8%9C ）
        本文引自萌娘百科(https://zh.moegirl.org.cn )，文字内容默认使用《知识共享 署名-非商业性使用-相同方式共享 3.0 中国大陆》协议。
      </p>
    </div>
  )
}
